favo_math = c('嫌い', '嫌い', '好き', '好き', '嫌い', '嫌い', '嫌い', '嫌い',
              '嫌い', '好き', '好き', '嫌い', '好き', '嫌い', '嫌い', '好き',
              '嫌い', '嫌い', '嫌い', '嫌い')

favo_stat = c('好き', '好き', '好き', '好き', '嫌い', '嫌い', '嫌い', '嫌い',
              '嫌い', '嫌い', '好き', '好き', '好き', '嫌い', '好き', '嫌い',
              '嫌い', '嫌い', '嫌い', '嫌い')

study_time = c(1, 3, 10, 12, 6, 3, 8, 4, 1, 5)
point = c(20, 40, 100, 80, 50, 50, 70, 50, 10, 60)

favo_dish = c(1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0)
favo_sweet = c(1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0)

table(favo_dish, favo_sweet)
cor(favo_dish, favo_sweet)